ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/**
*********************************************************************************************************
*               Copyright(c) 2020, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* @file     rtl876x_io_dlps.c
* @brief    This file provides all the IO DLPS control firmware functions.
* @details
* @author
* @date     2020-06-02
* @version  v1.0
*********************************************************************************************************
*/

#include <stddef.h>
#include "rtl876x_io_dlps.h"
#include "rtl876x_nvic.h"
#include "rtl876x_pinmux.h"
#include "rtl876x_rcc.h"
#include "app_section.h"
#include "board.h"
#include "dlps.h"
#include "otp.h"
#include "platform_autoconf.h"
#include "trace.h"

/*============================================================================*
 *                         IO DLPS
 *============================================================================*/

/** @defgroup IO_DLPS_Functions IO DLPS Functions
  * @{
  */

/********************************************** ********************************************************/
/**************************************** [PINMUX DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

__STATIC_INLINE void Pinmux_DLPS_Enter(void);
__STATIC_INLINE void Pinmux_DLPS_Exit(void);

uint32_t Pinmux_StoreReg[10];      /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  PINMUX enter dlps callback function(Save PINMUX register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE  void Pinmux_DLPS_Enter(void) DATA_RAM_FUNCTION;
void Pinmux_DLPS_Enter(void)
{
    uint8_t i = 0;

    for (i = 0; i < 10; i++)
    {
        Pinmux_StoreReg[i] = PINMUX->CFG[i];
    }

    return;
}

/**
  * @brief  PINMUX exit dlps callback function(Resume PINMUX register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE  void Pinmux_DLPS_Exit(void) DATA_RAM_FUNCTION;
void Pinmux_DLPS_Exit(void)
{
    uint8_t i;

    for (i = 0; i < 10; i++)
    {
        PINMUX->CFG[i] = Pinmux_StoreReg[i];
    }

    return;
}

/********************************************** ********************************************************/
/**************************************** [ADC DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

#if USE_ADC_DLPS
__STATIC_INLINE void ADC_DLPS_Enter(void);
__STATIC_INLINE void ADC_DLPS_Exit(void);

uint32_t ADC_StoreReg[14];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  ADC enter dlps callback function(Save ADC register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void ADC_DLPS_Enter(void) DATA_RAM_FUNCTION;
void ADC_DLPS_Enter(void)
{
    /*Open 10M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT28;

    PERIPH->PERI_FUNC1_EN |= (1 << 0);
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_ADC_EN_Msk | SYSBLK_SLPCK_ADC_EN_Msk);

    ADC_StoreReg[0] =  ADC->CR;          //0x04
    ADC_StoreReg[1] =  ADC->SCHCR;       //0x08
    ADC_StoreReg[2] =  ADC->INTCR;       //0x0C
    ADC_StoreReg[3] =  ADC->SCHTAB0;     //0x10
    ADC_StoreReg[4] =  ADC->SCHTAB1;     //0x14
    ADC_StoreReg[5] =  ADC->SCHTAB2;     //0x18
    ADC_StoreReg[6] =  ADC->SCHTAB3;     //0x1C
    ADC_StoreReg[7] =  ADC->SCHTAB4;     //0x20
    ADC_StoreReg[8] =  ADC->SCHTAB5;     //0x24
    ADC_StoreReg[9] =  ADC->SCHTAB6;     //0x28
    ADC_StoreReg[10] =  ADC->SCHTAB7;    //0x2C
    ADC_StoreReg[11] =  ADC->PWRDLY;
    ADC_StoreReg[12] =  ADC->DATCLK;
    ADC_StoreReg[13] =  ADC->ANACTL;

    uint8_t reg_value = 0;
    reg_value = btaon_fast_read_safe(0x110);
    btaon_fast_write(0x110, reg_value & (~0x04));

    return;
}

/**
  * @brief  ADC exit dlps callback function(Resume ADC register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void ADC_DLPS_Exit(void) DATA_RAM_FUNCTION;
void ADC_DLPS_Exit(void)
{
    /*Open 10M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT28;

    PERIPH->PERI_FUNC1_EN |= (1 << 0);
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_ADC_EN_Msk | SYSBLK_SLPCK_ADC_EN_Msk);

#if 0
    //Todo
    ADC->PWRDLY = ADC_StoreReg[10];
    ADC->CR = (ADC_StoreReg[0] & (~((uint32_t)0x03)));
    ADC->SCHTAB0 = ADC_StoreReg[3];
    ADC->SCHTAB1 = ADC_StoreReg[4];
    ADC->SCHTAB2 = ADC_StoreReg[5];
    ADC->SCHTAB3 = ADC_StoreReg[6];
    ADC->SCHTAB4 = ADC_StoreReg[7];
    ADC->SCHTAB5 = ADC_StoreReg[8];
    ADC->SCHTAB6 = ADC_StoreReg[9];
    ADC->SCHCR = ADC_StoreReg[1];
    ADC->INTCR = (ADC_StoreReg[2] & 0x1F);
#else
    /*Disable all interrupt.*/
    ADC->INTCR &= (~0x1f);

    /* Set power mode first */
    ADC->PWRDLY = ADC_StoreReg[11];

    /* Disable schedule table */
    ADC->SCHCR &= (~0xffff);

    ADC->SCHTAB0 = ADC_StoreReg[3];
    ADC->SCHTAB1 = ADC_StoreReg[4];
    ADC->SCHTAB2 = ADC_StoreReg[5];
    ADC->SCHTAB3 = ADC_StoreReg[6];
    ADC->SCHTAB4 = ADC_StoreReg[7];
    ADC->SCHTAB5 = ADC_StoreReg[8];
    ADC->SCHTAB6 = ADC_StoreReg[9];
    ADC->SCHTAB7 = ADC_StoreReg[10];
    ADC->SCHCR   = ADC_StoreReg[1];
    ADC->CR = (ADC_StoreReg[0] & (~((uint32_t)0x03)));
    ADC->DATCLK = ADC_StoreReg[12];
    ADC->ANACTL = ADC_StoreReg[13];

    /*Clear ADC FIFO */
    ADC->CR |= BIT26;
    /* Clear all interrupt */
    ADC->INTCR |= (0x1f << 8);

    /* Restore specify interrupt */
    ADC->INTCR = ADC_StoreReg[2];

#endif

