ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
    uint8_t reg_value = 0;
    reg_value = btaon_fast_read_safe(0x110);
    btaon_fast_write(0x110, reg_value | 0x04);

    return;
}

#endif

/********************************************** ********************************************************/
/**************************************** [CODEC DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_DLPS

uint32_t CODEC_StoreReg[14];

/**
  * @brief  CODEC enter dlps callback function(Save CODEC register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_StoreReg[0] = CODEC->CR0;
    CODEC_StoreReg[1] = CODEC->ADC0_CTRL0;
    CODEC_StoreReg[2] = CODEC->ADC0_CTRL1;
    CODEC_StoreReg[3] = CODEC->ADC1_CTRL0;
    CODEC_StoreReg[4] = CODEC->ADC1_CTRL1;
    CODEC_StoreReg[5] = CODEC->ANA_CR1;
    CODEC_StoreReg[6] = CODEC->ASRC_CR0;
    CODEC_StoreReg[7] = CODEC->ASRC_CR1;
    CODEC_StoreReg[8] = CODEC->CLK_CR1;
    CODEC_StoreReg[9] = CODEC->CLK_CR2;
    CODEC_StoreReg[10] = CODEC->CLK_CR3;
    CODEC_StoreReg[11] = CODEC->DAC_CTRL0;
    CODEC_StoreReg[12] = CODEC->DAC_CTRL1;
    CODEC_StoreReg[13] = CODEC->I2S_CTRL;
}

/**
  * @brief  CODEC exit dlps callback function(Resume CODEC register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    /* Initialize CODEC */
    if ((CODEC_StoreReg[3] & 0x900) == 0x900)
    {
        /* Configure AMIC parameters */
        CODEC->CR0 = CODEC_StoreReg[0];
    }

    CODEC->ADC0_CTRL0 = CODEC_StoreReg[1];
    CODEC->ADC0_CTRL1 = CODEC_StoreReg[2];
    CODEC->ADC1_CTRL0 = CODEC_StoreReg[3];
    CODEC->ADC1_CTRL1 = CODEC_StoreReg[4];
    CODEC->ANA_CR1 = CODEC_StoreReg[5];
    CODEC->ASRC_CR0 = CODEC_StoreReg[6];
    CODEC->ASRC_CR1 = CODEC_StoreReg[7];
    CODEC->CLK_CR1 = CODEC_StoreReg[8];
    CODEC->CLK_CR2 = CODEC_StoreReg[9];
    CODEC->CLK_CR3 = CODEC_StoreReg[10];
    CODEC->DAC_CTRL0 = CODEC_StoreReg[11];
    CODEC->DAC_CTRL1 = CODEC_StoreReg[12];
    CODEC->I2S_CTRL = CODEC_StoreReg[13];

}
#endif

/********************************************** ********************************************************/
/**************************************** [CODEC_CH0_EQ1 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_CH0_EQ1_DLPS

uint32_t CODEC_CH0_EQ1_StoreReg[5];

/**
  * @brief  CODEC_CH0_EQ1 enter dlps callback function(Save CODEC_CH0_EQ1 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ1_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ1_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ1_StoreReg[0] = CODEC_CH0_EQ1->EQ_H0;
    CODEC_CH0_EQ1_StoreReg[1] = CODEC_CH0_EQ1->EQ_B1;
    CODEC_CH0_EQ1_StoreReg[2] = CODEC_CH0_EQ1->EQ_B2;
    CODEC_CH0_EQ1_StoreReg[3] = CODEC_CH0_EQ1->EQ_A1;
    CODEC_CH0_EQ1_StoreReg[4] = CODEC_CH0_EQ1->EQ_A2;
}

/**
  * @brief  CODEC_EQ1 exit dlps callback function(Resume CODEC_EQ1 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ1_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ1_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ1->EQ_H0 = CODEC_CH0_EQ1_StoreReg[0];
    CODEC_CH0_EQ1->EQ_B1 = CODEC_CH0_EQ1_StoreReg[1];
    CODEC_CH0_EQ1->EQ_B2 = CODEC_CH0_EQ1_StoreReg[2];
    CODEC_CH0_EQ1->EQ_A1 = CODEC_CH0_EQ1_StoreReg[3];
    CODEC_CH0_EQ1->EQ_A2 = CODEC_CH0_EQ1_StoreReg[4];
}
#endif

/********************************************** ********************************************************/
/**************************************** [CODEC_CH0_EQ2 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_CH0_EQ2_DLPS

uint32_t CODEC_CH0_EQ2_StoreReg[5];

/**
  * @brief  CODEC_CH0_EQ2 enter dlps callback function(Save CODEC_CH0_EQ2 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ2_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ2_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ2_StoreReg[0] = CODEC_CH0_EQ2->EQ_H0;
    CODEC_CH0_EQ2_StoreReg[1] = CODEC_CH0_EQ2->EQ_B1;
    CODEC_CH0_EQ2_StoreReg[2] = CODEC_CH0_EQ2->EQ_B2;
    CODEC_CH0_EQ2_StoreReg[3] = CODEC_CH0_EQ2->EQ_A1;
    CODEC_CH0_EQ2_StoreReg[4] = CODEC_CH0_EQ2->EQ_A2;
}

/**
  * @brief  CODEC_CH0_EQ2 exit dlps callback function(Resume CODEC_CH0_EQ2 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ2_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ2_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ2->EQ_H0 = CODEC_CH0_EQ2_StoreReg[0];
    CODEC_CH0_EQ2->EQ_B1 = CODEC_CH0_EQ2_StoreReg[1];
    CODEC_CH0_EQ2->EQ_B2 = CODEC_CH0_EQ2_StoreReg[2];
    CODEC_CH0_EQ2->EQ_A1 = CODEC_CH0_EQ2_StoreReg[3];
    CODEC_CH0_EQ2->EQ_A2 = CODEC_CH0_EQ2_StoreReg[4];
}
#endif

