ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/********************************************** ********************************************************/
/**************************************** [CODEC_CH0_EQ3 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_CH0_EQ3_DLPS

uint32_t CODEC_CH0_EQ3_StoreReg[5];

/**
  * @brief  CODEC_CH0_EQ3 enter dlps callback function(Save CODEC_CH0_EQ3 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ3_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ3_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ3_StoreReg[0] = CODEC_CH0_EQ3->EQ_H0;
    CODEC_CH0_EQ3_StoreReg[1] = CODEC_CH0_EQ3->EQ_B1;
    CODEC_CH0_EQ3_StoreReg[2] = CODEC_CH0_EQ3->EQ_B2;
    CODEC_CH0_EQ3_StoreReg[3] = CODEC_CH0_EQ3->EQ_A1;
    CODEC_CH0_EQ3_StoreReg[4] = CODEC_CH0_EQ3->EQ_A2;
}

/**
  * @brief  CODEC_CH0_EQ3 exit dlps callback function(Resume CODEC_CH0_EQ3 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ3_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ3_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ3->EQ_H0 = CODEC_CH0_EQ3_StoreReg[0];
    CODEC_CH0_EQ3->EQ_B1 = CODEC_CH0_EQ3_StoreReg[1];
    CODEC_CH0_EQ3->EQ_B2 = CODEC_CH0_EQ3_StoreReg[2];
    CODEC_CH0_EQ3->EQ_A1 = CODEC_CH0_EQ3_StoreReg[3];
    CODEC_CH0_EQ3->EQ_A2 = CODEC_CH0_EQ3_StoreReg[4];
}
#endif

/********************************************** ********************************************************/
/**************************************** [CODEC_CH0_EQ4 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_CH0_EQ4_DLPS

uint32_t CODEC_CH0_EQ4_StoreReg[5];

/**
  * @brief  CODEC_CH0_EQ4 enter dlps callback function(Save CODEC_CH0_EQ4 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ4_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ4_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ4_StoreReg[0] = CODEC_CH0_EQ4->EQ_H0;
    CODEC_CH0_EQ4_StoreReg[1] = CODEC_CH0_EQ4->EQ_B1;
    CODEC_CH0_EQ4_StoreReg[2] = CODEC_CH0_EQ4->EQ_B2;
    CODEC_CH0_EQ4_StoreReg[3] = CODEC_CH0_EQ4->EQ_A1;
    CODEC_CH0_EQ4_StoreReg[4] = CODEC_CH0_EQ4->EQ_A2;
}

/**
  * @brief  CODEC_CH0_EQ4 exit dlps callback function(Resume CODEC_CH0_EQ4 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ4_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ4_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ4->EQ_H0 = CODEC_CH0_EQ4_StoreReg[0];
    CODEC_CH0_EQ4->EQ_B1 = CODEC_CH0_EQ4_StoreReg[1];
    CODEC_CH0_EQ4->EQ_B2 = CODEC_CH0_EQ4_StoreReg[2];
    CODEC_CH0_EQ4->EQ_A1 = CODEC_CH0_EQ4_StoreReg[3];
    CODEC_CH0_EQ4->EQ_A2 = CODEC_CH0_EQ4_StoreReg[4];
}
#endif

/********************************************** ********************************************************/
/**************************************** [CODEC_CH0_EQ5 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_CODEC_CH0_EQ5_DLPS

uint32_t CODEC_CH0_EQ5_StoreReg[5];

/**
  * @brief  CODEC_CH0_EQ5 enter dlps callback function(Save CODEC_CH0_EQ5 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ5_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ5_DLPS_Enter(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ5_StoreReg[0] = CODEC_CH0_EQ5->EQ_H0;
    CODEC_CH0_EQ5_StoreReg[1] = CODEC_CH0_EQ5->EQ_B1;
    CODEC_CH0_EQ5_StoreReg[2] = CODEC_CH0_EQ5->EQ_B2;
    CODEC_CH0_EQ5_StoreReg[3] = CODEC_CH0_EQ5->EQ_A1;
    CODEC_CH0_EQ5_StoreReg[4] = CODEC_CH0_EQ5->EQ_A2;
}

/**
  * @brief  CODEC_CH0_EQ5 exit dlps callback function(Resume CODEC_CH0_EQ5 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CODEC_CH0_EQ5_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CODEC_CH0_EQ5_DLPS_Exit(void)
{
    /* Enable codec function and clock */
    PERIPH->PERI_BD_FUNC0_EN |= (1 << 0) | (1 << 4);

    CODEC_CH0_EQ5->EQ_H0 = CODEC_CH0_EQ5_StoreReg[0];
    CODEC_CH0_EQ5->EQ_B1 = CODEC_CH0_EQ5_StoreReg[1];
    CODEC_CH0_EQ5->EQ_B2 = CODEC_CH0_EQ5_StoreReg[2];
    CODEC_CH0_EQ5->EQ_A1 = CODEC_CH0_EQ5_StoreReg[3];
    CODEC_CH0_EQ5->EQ_A2 = CODEC_CH0_EQ5_StoreReg[4];
}
#endif

/********************************************** ********************************************************/
/**************************************** [GPIO DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_GPIO_DLPS

__STATIC_INLINE void GPIO_DLPS_Enter(void);
__STATIC_INLINE void GPIO_DLPS_Exit(void);

uint32_t GPIO_StoreReg[9];         /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  GPIO enter dlps callback function(Save GPIO register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void GPIO_DLPS_Enter(void) DATA_RAM_FUNCTION;
void GPIO_DLPS_Enter(void)
{
    PERIPH->PERI_FUNC1_EN |= BIT_PERI_GPIO_EN;
    PERIPH->PERI_CLK_CTRL |= (BIT_SOC_ACTCK_GPIO_EN | SYSBLK_SLPCK_GPIO_EN_Msk);

    GPIO_StoreReg[0] = GPIO->DATAOUT;
    GPIO_StoreReg[1] = GPIO->DATADIR;
    GPIO_StoreReg[2] = GPIO->DATASRC;
    GPIO_StoreReg[3] = GPIO->INTEN;
    GPIO_StoreReg[4] = GPIO->INTMASK;
    GPIO_StoreReg[5] = GPIO->INTTYPE;
    GPIO_StoreReg[6] = GPIO->INTPOLARITY;
    GPIO_StoreReg[7] = GPIO->DEBOUNCE;
    GPIO_StoreReg[8] = *(__IO uint32_t *)(0x40000344UL);

    return;
}

/**
  * @brief  GPIO exit dlps callback function(Resume GPIO register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void GPIO_DLPS_Exit(void) DATA_RAM_FUNCTION;
void GPIO_DLPS_Exit(void)
{
    PERIPH->PERI_FUNC1_EN |= BIT_PERI_GPIO_EN;
    PERIPH->PERI_CLK_CTRL |= (BIT_SOC_ACTCK_GPIO_EN | SYSBLK_SLPCK_GPIO_EN_Msk);

    GPIO->DATADIR       = GPIO_StoreReg[1];
    GPIO->DATASRC       = GPIO_StoreReg[2];
    GPIO->INTMASK       = GPIO_StoreReg[4];
    GPIO->INTTYPE       = GPIO_StoreReg[5];
    GPIO->INTPOLARITY   = GPIO_StoreReg[6];
    GPIO->DEBOUNCE      = GPIO_StoreReg[7];
    GPIO->DATAOUT       = GPIO_StoreReg[0];
    GPIO->INTCLR        = ~(GPIO_StoreReg[1]);
    GPIO->INTEN         = GPIO_StoreReg[3];
    *(__IO uint32_t *)(0x40000344UL) = GPIO_StoreReg[8];

    return;
}
#endif  /* USE_GPIO_DLPS */

