ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/********************************************** ********************************************************/
/**************************************** [I2C0 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_I2C0_DLPS
__STATIC_INLINE void I2C0_DLPS_Enter(void);
__STATIC_INLINE void I2C0_DLPS_Exit(void);

uint32_t I2C0_StoreReg[20];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  I2C0 enter dlps callback function(Save I2C0 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2C0_DLPS_Enter(void) DATA_RAM_FUNCTION;
void I2C0_DLPS_Enter(void)
{
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_I2C0_EN_Msk | SYSBLK_SLPCK_I2C0_EN_Msk);
    PERIPH->PERI_FUNC0_EN |= SYSBLK_I2C0_EN_Msk;

    I2C0_StoreReg[0] = I2C0->IC_CON;
    I2C0_StoreReg[1] = I2C0->IC_TAR;
    I2C0_StoreReg[2] = I2C0->IC_SAR;
    I2C0_StoreReg[3] = I2C0->IC_HS_MADDR;

    I2C0_StoreReg[4] = I2C0->IC_SS_SCL_HCNT;
    I2C0_StoreReg[5] = I2C0->IC_SS_SCL_LCNT;
    I2C0_StoreReg[6] = I2C0->IC_FS_SCL_HCNT;
    I2C0_StoreReg[7] = I2C0->IC_FS_SCL_LCNT;
    I2C0_StoreReg[8] = I2C0->IC_HS_SCL_HCNT;
    I2C0_StoreReg[9] = I2C0->IC_HS_SCL_LCNT;

    I2C0_StoreReg[10] = I2C0->IC_INTR_MASK;
    I2C0_StoreReg[11] = I2C0->IC_RX_TL;
    I2C0_StoreReg[12] = I2C0->IC_TX_TL;
    I2C0_StoreReg[13] = I2C0->IC_ENABLE;
    I2C0_StoreReg[14] = I2C0->IC_SDA_HOLD;
    I2C0_StoreReg[15] = I2C0->IC_SLV_DATA_NACK_ONLY;
    I2C0_StoreReg[16] = I2C0->IC_DMA_CR;
    I2C0_StoreReg[17] = I2C0->IC_DMA_TDLR;
    I2C0_StoreReg[18] = I2C0->IC_DMA_RDLR;

    I2C0_StoreReg[19] = I2C0->IC_SDA_SETUP;
}

/**
  * @brief  I2C0 exit dlps callback function(Resume I2C0 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2C0_DLPS_Exit(void) DATA_RAM_FUNCTION;
void I2C0_DLPS_Exit(void)
{
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_I2C0_EN_Msk | SYSBLK_SLPCK_I2C0_EN_Msk);
    PERIPH->PERI_FUNC0_EN |= SYSBLK_I2C0_EN_Msk;

    I2C0->IC_CON = I2C0_StoreReg[0];
    I2C0->IC_TAR = I2C0_StoreReg[1];
    I2C0->IC_SAR = I2C0_StoreReg[2];
    I2C0->IC_HS_MADDR = I2C0_StoreReg[3];

    I2C0->IC_SS_SCL_HCNT = I2C0_StoreReg[4];
    I2C0->IC_SS_SCL_LCNT = I2C0_StoreReg[5];
    I2C0->IC_FS_SCL_HCNT = I2C0_StoreReg[6];
    I2C0->IC_FS_SCL_LCNT = I2C0_StoreReg[7];
    I2C0->IC_HS_SCL_HCNT = I2C0_StoreReg[8];
    I2C0->IC_HS_SCL_LCNT = I2C0_StoreReg[9];

    I2C0->IC_INTR_MASK = I2C0_StoreReg[10];
    I2C0->IC_RX_TL = I2C0_StoreReg[11];
    I2C0->IC_TX_TL = I2C0_StoreReg[12];
    I2C0->IC_SDA_HOLD = I2C0_StoreReg[14];
    I2C0->IC_SLV_DATA_NACK_ONLY = I2C0_StoreReg[15];
    I2C0->IC_DMA_CR = I2C0_StoreReg[16];
    I2C0->IC_DMA_TDLR = I2C0_StoreReg[17];
    I2C0->IC_DMA_RDLR = I2C0_StoreReg[18];
    I2C0->IC_SDA_SETUP = I2C0_StoreReg[19];

    I2C0->IC_ENABLE = I2C0_StoreReg[13];
}
#endif

/********************************************** ********************************************************/
/**************************************** [I2C1 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_I2C1_DLPS
__STATIC_INLINE void I2C1_DLPS_Enter(void);
__STATIC_INLINE void I2C1_DLPS_Exit(void);

uint32_t I2C1_StoreReg[20];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  I2C1 enter dlps callback function(Save I2C1 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2C1_DLPS_Enter(void) DATA_RAM_FUNCTION;
void I2C1_DLPS_Enter(void)
{
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_I2C1_EN_Msk | SYSBLK_SLPCK_I2C1_EN_Msk);
    PERIPH->PERI_FUNC0_EN |= SYSBLK_I2C1_EN_Msk;

    I2C1_StoreReg[0] = I2C1->IC_CON;
    I2C1_StoreReg[1] = I2C1->IC_TAR;
    I2C1_StoreReg[2] = I2C1->IC_SAR;
    I2C1_StoreReg[3] = I2C1->IC_HS_MADDR;

    I2C1_StoreReg[4] = I2C1->IC_SS_SCL_HCNT;
    I2C1_StoreReg[5] = I2C1->IC_SS_SCL_LCNT;
    I2C1_StoreReg[6] = I2C1->IC_FS_SCL_HCNT;
    I2C1_StoreReg[7] = I2C1->IC_FS_SCL_LCNT;
    I2C1_StoreReg[8] = I2C1->IC_HS_SCL_HCNT;
    I2C1_StoreReg[9] = I2C1->IC_HS_SCL_LCNT;

    I2C1_StoreReg[10] = I2C1->IC_INTR_MASK;
    I2C1_StoreReg[11] = I2C1->IC_RX_TL;
    I2C1_StoreReg[12] = I2C1->IC_TX_TL;
    I2C1_StoreReg[13] = I2C1->IC_ENABLE;
    I2C1_StoreReg[14] = I2C1->IC_SDA_HOLD;
    I2C1_StoreReg[15] = I2C1->IC_SLV_DATA_NACK_ONLY;
    I2C1_StoreReg[16] = I2C1->IC_DMA_CR;
    I2C1_StoreReg[17] = I2C1->IC_DMA_TDLR;
    I2C1_StoreReg[18] = I2C1->IC_DMA_RDLR;

    I2C1_StoreReg[19] = I2C1->IC_SDA_SETUP;
}

/**
  * @brief  I2C1 exit dlps callback function(Resume I2C1 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2C1_DLPS_Exit(void) DATA_RAM_FUNCTION;
void I2C1_DLPS_Exit(void)
{
    PERIPH->PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_I2C1_EN_Msk | SYSBLK_SLPCK_I2C1_EN_Msk);
    PERIPH->PERI_FUNC0_EN |= SYSBLK_I2C1_EN_Msk;

    I2C1->IC_CON = I2C1_StoreReg[0];
    I2C1->IC_TAR = I2C1_StoreReg[1];
    I2C1->IC_SAR = I2C1_StoreReg[2];
    I2C1->IC_HS_MADDR = I2C1_StoreReg[3];

    I2C1->IC_SS_SCL_HCNT = I2C1_StoreReg[4];
    I2C1->IC_SS_SCL_LCNT = I2C1_StoreReg[5];
    I2C1->IC_FS_SCL_HCNT = I2C1_StoreReg[6];
    I2C1->IC_FS_SCL_LCNT = I2C1_StoreReg[7];
    I2C1->IC_HS_SCL_HCNT = I2C1_StoreReg[8];
    I2C1->IC_HS_SCL_LCNT = I2C1_StoreReg[9];

    I2C1->IC_INTR_MASK = I2C1_StoreReg[10];
    I2C1->IC_RX_TL = I2C1_StoreReg[11];
    I2C1->IC_TX_TL = I2C1_StoreReg[12];
    I2C1->IC_SDA_HOLD = I2C1_StoreReg[14];
    I2C1->IC_SLV_DATA_NACK_ONLY = I2C1_StoreReg[15];
    I2C1->IC_DMA_CR = I2C1_StoreReg[16];
    I2C1->IC_DMA_TDLR = I2C1_StoreReg[17];
    I2C1->IC_DMA_RDLR = I2C1_StoreReg[18];
    I2C1->IC_SDA_SETUP = I2C1_StoreReg[19];

    I2C1->IC_ENABLE = I2C1_StoreReg[13];
}
#endif

