ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/********************************************** ********************************************************/
/**************************************** [I2S0 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_I2S0_DLPS

uint32_t I2S0_StoreReg[4];

/**
  * @brief  I2S0 enter dlps callback function(Save I2S0 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2S0_DLPS_Enter(void) DATA_RAM_FUNCTION;
void I2S0_DLPS_Enter(void)
{
    PERIPH->PERI_BD_FUNC0_EN |= BIT(1) | BIT(5) | BIT(8);

    I2S0_StoreReg[0] = I2S0->BCLK_DIV;
    I2S0_StoreReg[1] = I2S0->CTRL0;
    I2S0_StoreReg[2] = I2S0->CTRL1;
    I2S0_StoreReg[3] = I2S0->DMA_TRDLR;
}

/**
  * @brief  I2S0 exit dlps callback function(Resume I2S0 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2S0_DLPS_Exit(void) DATA_RAM_FUNCTION;
void I2S0_DLPS_Exit(void)
{
    PERIPH->PERI_BD_FUNC0_EN |= BIT(1) | BIT(5) | BIT(8);

    /* Reset I2S0 module */
    I2S0->CTRL0 |= 1 << 0;
    I2S0->CTRL0 &= ~(1 << 0);

    /* Initialize I2S0 */
    I2S0->BCLK_DIV  = I2S0_StoreReg[0];
    I2S0->CTRL1     = I2S0_StoreReg[2];
    I2S0->DMA_TRDLR = I2S0_StoreReg[3];
    I2S0->CTRL0     = I2S0_StoreReg[1];
}
#endif

/********************************************** ********************************************************/
/**************************************** [I2S1 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_I2S1_DLPS

uint32_t I2S1_StoreReg[4];

/**
  * @brief  I2S1 enter dlps callback function(Save I2S1 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2S1_DLPS_Enter(void) DATA_RAM_FUNCTION;
void I2S1_DLPS_Enter(void)
{
    PERIPH->PERI_BD_FUNC0_EN |= BIT(2) | BIT(6) | BIT(8);

    I2S1_StoreReg[0] = I2S1->BCLK_DIV;
    I2S1_StoreReg[1] = I2S1->CTRL0;
    I2S1_StoreReg[2] = I2S1->CTRL1;
    I2S1_StoreReg[3] = I2S1->DMA_TRDLR;
}

/**
  * @brief  I2S1 exit dlps callback function(Resume I2S1 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void I2S1_DLPS_Exit(void) DATA_RAM_FUNCTION;
void I2S1_DLPS_Exit(void)
{
    PERIPH->PERI_BD_FUNC0_EN |= BIT(2) | BIT(6) | BIT(8);

    /* Reset I2S1 module */
    I2S1->CTRL0 |= 1 << 0;
    I2S1->CTRL0 &= ~(1 << 0);

    /* Initialize I2S1 */
    I2S1->BCLK_DIV  = I2S1_StoreReg[0];
    I2S1->CTRL1     = I2S1_StoreReg[2];
    I2S1->DMA_TRDLR = I2S1_StoreReg[3];
    I2S1->CTRL0     = I2S1_StoreReg[1];
}
#endif

/********************************************** ********************************************************/
/**************************************** [IF8080 DLPS] ************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_IF8080_DLPS

uint32_t IF8080_StoreReg[5];

/**
  * @brief  IF8080 enter dlps callback function(Save IF8080 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void IF8080_DLPS_Enter(void) DATA_RAM_FUNCTION;
void IF8080_DLPS_Enter(void)
{
    /* Enable IF8080 interface controller function */
    PERIPH->PERI_FUNC0_EN |= BIT(25);
    /* Enable IF8080 interface controller clock */
    PERIPH->PERI_CLK_CTRL1 |= BIT(28) | BIT(29);

    IF8080_StoreReg[0] = *((volatile uint32_t *)0x400002A8UL) & (0x03 << 28);
    IF8080_StoreReg[1] = IF8080->IMR;
    IF8080_StoreReg[2] = IF8080->CTRL0;
    IF8080_StoreReg[3] = IF8080->CTRL1;
    IF8080_StoreReg[4] = IF8080->CFG;

}

/**
  * @brief  IF8080 exit dlps callback function(Resume IF8080 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void IF8080_DLPS_Exit(void) DATA_RAM_FUNCTION;
void IF8080_DLPS_Exit(void)
{
    /* Enable IF8080 8080 interface controller function */
    PERIPH->PERI_FUNC0_EN |= BIT(25);
    /* Enable IF8080 8080 interface controller clock */
    PERIPH->PERI_CLK_CTRL1 |= BIT(28) | BIT(29);

    /* Restore Dedicated SDIO pin option */
    *((volatile uint32_t *)0x400002A8UL) &= ~(0x03 << 28);
    *((volatile uint32_t *)0x400002A8UL) |= IF8080_StoreReg[0];

    /* Initialize IF8080 */

    IF8080->IMR    = IF8080_StoreReg[1];
    IF8080->CTRL1  = IF8080_StoreReg[3];
    IF8080->CFG    = IF8080_StoreReg[4];
    IF8080->CTRL0  = IF8080_StoreReg[2];
}
#endif

/********************************************** ********************************************************/
/**************************************** [IR DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

#if USE_IR_DLPS
__STATIC_INLINE void IR_DLPS_Enter(void);
__STATIC_INLINE void IR_DLPS_Exit(void);

uint32_t IR_StoreReg[6];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  IR enter dlps callback function(Save IR register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void IR_DLPS_Enter(void) DATA_RAM_FUNCTION;
void IR_DLPS_Enter(void)
{
    PERIPH->PERI_FUNC0_EN |= (1 << 10);
    PERIPH->PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_IR_EN_Msk | SYSBLK_SLPCK_IR_EN_Msk);

    IR_StoreReg[0] = IR->CLK_DIV;
    IR_StoreReg[1] = IR->TX_CONFIG;
    IR_StoreReg[2] = IR->RX_CONFIG;
    IR_StoreReg[3] = IR->RX_CNT_INT_SEL;


    return;
}

/**
  * @brief  IR exit dlps callback function(Resume IR register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void IR_DLPS_Exit(void) DATA_RAM_FUNCTION;
void IR_DLPS_Exit(void)
{
    PERIPH->PERI_FUNC0_EN |= (1 << 10);
    PERIPH->PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_IR_EN_Msk | SYSBLK_SLPCK_IR_EN_Msk);

    IR->CLK_DIV = IR_StoreReg[0];
    if (IR_StoreReg[1] & BIT31)
    {
        /* RX MODE */
        IR->TX_CONFIG  = IR_StoreReg[1];
        IR->RX_CONFIG  = IR_StoreReg[2];
        IR->RX_CNT_INT_SEL  = IR_StoreReg[3];
    }
    else
    {
        /* TX MODE */
        IR->TX_CONFIG  = IR_StoreReg[1];
        /* If IR TX mode is idle, must write one data firstly */
        IR->TX_FIFO = 0;
    }

    return;
}

#endif

