ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/********************************************** ********************************************************/
/**************************************** [KEYSCAN DLPS] ***********************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_KEYSCAN_DLPS

__STATIC_INLINE void KeyScan_DLPS_Enter(void);
__STATIC_INLINE void KeyScan_DLPS_Exit(void);

uint32_t KeyScan_StoreReg[7];      /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  KEYSCAN enter dlps callback function(Save KEYSCAN register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void KeyScan_DLPS_Enter(void) DATA_RAM_FUNCTION;
void KeyScan_DLPS_Enter(void)
{
    /*Open 5M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT29;

    PERIPH->PERI_FUNC0_EN |= BIT_PERI_KEYSCAN_EN;
    PERIPH->PERI_CLK_CTRL1 |= (BIT_SOC_ACTCK_KEYSCAN_EN | SYSBLK_SLPCK_KEYSCAN_EN_Msk);

    KeyScan_StoreReg[0] = KEYSCAN->CLKDIV;               /* 0x00 */
    KeyScan_StoreReg[1] = KEYSCAN->TIMERCR;              /* 0x04 */
    KeyScan_StoreReg[2] = KEYSCAN->CR;                   /* 0x08 */
    KeyScan_StoreReg[3] = KEYSCAN->COLCR;                /* 0x0C */
    KeyScan_StoreReg[4] = KEYSCAN->ROWCR;                /* 0x10 */
    KeyScan_StoreReg[6] = KEYSCAN->INTMASK;              /* 0x18 */

    return;
}

/**
  * @brief  KEYSCAN exit dlps callback function(Resume KEYSCAN register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void KeyScan_DLPS_Exit(void) DATA_RAM_FUNCTION;
void KeyScan_DLPS_Exit(void)
{
    /*Open 5M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT29;

    PERIPH->PERI_FUNC0_EN |= BIT_PERI_KEYSCAN_EN;
    PERIPH->PERI_CLK_CTRL1 |= (BIT_SOC_ACTCK_KEYSCAN_EN | SYSBLK_SLPCK_KEYSCAN_EN_Msk);

    /* Set FSM to idle state */
    KEYSCAN->CR &= ~BIT31;
    KEYSCAN->CLKDIV = KeyScan_StoreReg[0];
    KEYSCAN->CR = (KeyScan_StoreReg[2] & (~(BIT31)));
    KEYSCAN->TIMERCR = KeyScan_StoreReg[1];
    KEYSCAN->COLCR = KeyScan_StoreReg[3];
    KEYSCAN->ROWCR = KeyScan_StoreReg[4];
    KEYSCAN->INTMASK = KeyScan_StoreReg[6];
    KEYSCAN->CR |= (KeyScan_StoreReg[2] & ((BIT31)));

    return;
}
#endif /* USE_KEYSCAN_DLPS */


/********************************************** ********************************************************/
/**************************************** [QDEC DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_QDECODER_DLPS
__STATIC_INLINE void QuadDecoder_DLPS_Enter(void);
__STATIC_INLINE void QuadDecoder_DLPS_Exit(void);

uint32_t QuadDecoder_StoreReg[5];  /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  QDEC enter dlps callback function(Save QDEC register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void QuadDecoder_DLPS_Enter(void) DATA_RAM_FUNCTION;
void QuadDecoder_DLPS_Enter(void)
{
    /*Open 20M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT27;
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |= SYSBLK_QDECODE_EN_Msk;
    SYSBLKCTRL->u_238.PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_QDECODE_EN_Msk | SYSBLK_SLPCK_QDECODE_EN_Msk);

    QuadDecoder_StoreReg[0] = QDEC->REG_DIV;
    QuadDecoder_StoreReg[1] = QDEC->REG_CR_X;
    QuadDecoder_StoreReg[2] = QDEC->REG_CR_Y;
    QuadDecoder_StoreReg[3] = QDEC->REG_CR_Z;
    QuadDecoder_StoreReg[4] = QDEC->INT_MASK;

    return;
}

/**
  * @brief  QDEC exit dlps callback function(Resume QDEC register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void QuadDecoder_DLPS_Exit(void) DATA_RAM_FUNCTION;
void QuadDecoder_DLPS_Exit(void)
{
    /*Open 20M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT27;
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |= SYSBLK_QDECODE_EN_Msk;
    SYSBLKCTRL->u_238.PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_QDECODE_EN_Msk | SYSBLK_SLPCK_QDECODE_EN_Msk);

    //clear flags
    QDEC->REG_DIV  = QuadDecoder_StoreReg[0];
    QDEC->REG_CR_X = QuadDecoder_StoreReg[1];
    QDEC->REG_CR_Y = QuadDecoder_StoreReg[2];
    QDEC->REG_CR_Z = QuadDecoder_StoreReg[3];
    QDEC->INT_MASK = QuadDecoder_StoreReg[4];

    return;
}
#endif

/********************************************** ********************************************************/
/**************************************** [SPI0 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_SPI0_DLPS
__STATIC_INLINE void SPI0_DLPS_Enter(void);
__STATIC_INLINE void SPI0_DLPS_Exit(void);

uint32_t SPI0_StoreReg[14];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  SPI0 enter dlps callback function(Save SPI0 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI0_DLPS_Enter(void) DATA_RAM_FUNCTION;
void SPI0_DLPS_Enter(void)
{
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI0_EN_Msk;
    SYSBLKCTRL->u_234.PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_SPI0_EN_Msk | SYSBLK_SLPCK_SPI0_EN_Msk);

    SPI0_StoreReg[0] = SPI0->CTRLR0;
    SPI0_StoreReg[1] = SPI0->CTRLR1;
    SPI0_StoreReg[2] = SPI0->SSIENR;
    SPI0_StoreReg[3] = SPI0->SER;
    SPI0_StoreReg[4] = SPI0->BAUDR;
    SPI0_StoreReg[5] = SPI0->TXFTLR;
    SPI0_StoreReg[6] = SPI0->RXFTLR;
    SPI0_StoreReg[7] = SPI0->IMR;
    SPI0_StoreReg[8] = SPI0->DMACR;
    SPI0_StoreReg[9] = SPI0->DMATDLR;
    SPI0_StoreReg[10] = SPI0->DMARDLR;
    SPI0_StoreReg[11] = SPI0->RX_SAMPLE_DLY;
    SPI0_StoreReg[12] = *(volatile uint32_t *)0x40000308;
    SPI0_StoreReg[13] = *(volatile uint32_t *)0x4000035CUL;
}

/**
  * @brief  SPI0 exit dlps callback function(Resume SPI0 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI0_DLPS_Exit(void) DATA_RAM_FUNCTION;
void SPI0_DLPS_Exit(void)
{
    *(volatile uint32_t *)0x4000035CUL = SPI0_StoreReg[13];
    *(volatile uint32_t *)0x40000308 = SPI0_StoreReg[12];
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI0_EN_Msk;
    SYSBLKCTRL->u_234.PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_SPI0_EN_Msk | SYSBLK_SLPCK_SPI0_EN_Msk);

    SPI0->CTRLR0 = SPI0_StoreReg[0];
    SPI0->CTRLR1 = SPI0_StoreReg[1];
    SPI0->SER = SPI0_StoreReg[3];
    SPI0->BAUDR = SPI0_StoreReg[4];
    SPI0->TXFTLR = SPI0_StoreReg[5];
    SPI0->RXFTLR = SPI0_StoreReg[6];
    SPI0->IMR = SPI0_StoreReg[7];
    SPI0->DMACR = SPI0_StoreReg[8];
    SPI0->DMATDLR = SPI0_StoreReg[9];
    SPI0->DMARDLR = SPI0_StoreReg[10];
    SPI0->RX_SAMPLE_DLY = SPI0_StoreReg[11];

    /* Enable the selected SPI peripheral */
    SPI0->SSIENR = SPI0_StoreReg[2];
}
#endif


