ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
/********************************************** ********************************************************/
/**************************************** [SPI1 DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_SPI1_DLPS
__STATIC_INLINE void SPI1_DLPS_Enter(void);
__STATIC_INLINE void SPI1_DLPS_Exit(void);

uint32_t SPI1_StoreReg[14];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  SPI1 enter dlps callback function(Save SPI1 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI1_DLPS_Enter(void) DATA_RAM_FUNCTION;
void SPI1_DLPS_Enter(void)
{
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI1_EN_Msk;
    SYSBLKCTRL->u_234.PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_SPI1_EN_Msk | SYSBLK_SLPCK_SPI1_EN_Msk);

    SPI1_StoreReg[0] = SPI1->CTRLR0;
    SPI1_StoreReg[1] = SPI1->CTRLR1;
    SPI1_StoreReg[2] = SPI1->SSIENR;
    SPI1_StoreReg[3] = SPI1->SER;
    SPI1_StoreReg[4] = SPI1->BAUDR;
    SPI1_StoreReg[5] = SPI1->TXFTLR;
    SPI1_StoreReg[6] = SPI1->RXFTLR;
    SPI1_StoreReg[7] = SPI1->IMR;
    SPI1_StoreReg[8] = SPI1->DMACR;
    SPI1_StoreReg[9] = SPI1->DMATDLR;
    SPI1_StoreReg[10] = SPI1->DMARDLR;
    SPI1_StoreReg[11] = SPI1->RX_SAMPLE_DLY;
    SPI1_StoreReg[12] = *(volatile uint32_t *)0x40000308;
    SPI1_StoreReg[13] = *(volatile uint32_t *)0x4000035CUL;
}

/**
  * @brief  SPI1 exit dlps callback function(Resume SPI1 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI1_DLPS_Exit(void) DATA_RAM_FUNCTION;
void SPI1_DLPS_Exit(void)
{
    *(volatile uint32_t *)0x4000035CUL = SPI1_StoreReg[13];
    *(volatile uint32_t *)0x40000308 = SPI1_StoreReg[12];
    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI1_EN_Msk;
    SYSBLKCTRL->u_234.PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_SPI1_EN_Msk | SYSBLK_SLPCK_SPI1_EN_Msk);

    SPI1->CTRLR0 = SPI1_StoreReg[0];
    SPI1->CTRLR1 = SPI1_StoreReg[1];
    SPI1->SER = SPI1_StoreReg[3];
    SPI1->BAUDR = SPI1_StoreReg[4];
    SPI1->TXFTLR = SPI1_StoreReg[5];
    SPI1->RXFTLR = SPI1_StoreReg[6];
    SPI1->IMR = SPI1_StoreReg[7];
    SPI1->DMACR = SPI1_StoreReg[8];
    SPI1->DMATDLR = SPI1_StoreReg[9];
    SPI1->DMARDLR = SPI1_StoreReg[10];
    SPI1->RX_SAMPLE_DLY = SPI1_StoreReg[11];

    /* Enable the selected SPI peripheral */
    SPI1->SSIENR = SPI1_StoreReg[2];
}
#endif

/********************************************** ********************************************************/
/**************************************** [SPI2W DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_SPI2W_DLPS
__STATIC_INLINE void SPI2W_DLPS_Enter(void);
__STATIC_INLINE void SPI2W_DLPS_Exit(void);

uint32_t SPI2W_StoreReg[1];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  SPI2W enter dlps callback function(Save SPI2W register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI2W_DLPS_Enter(void) DATA_RAM_FUNCTION;
void SPI2W_DLPS_Enter(void)
{
    /*Open 20M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT27;

    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI2W_EN_Msk;
    SYSBLKCTRL->u_238.PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_SPI2WIRE_EN_Msk | SYSBLK_SLPCK_SPI2WIRE_EN_Msk);

    SPI2W_StoreReg[0] = SPI3WIRE->CFGR;
}

/**
  * @brief  SPI2W exit dlps callback function(Resume SPI2W register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void SPI2W_DLPS_Exit(void) DATA_RAM_FUNCTION;
void SPI2W_DLPS_Exit(void)
{
    /*Open 20M clock source*/
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT26;
    SYSBLKCTRL->u_20C.RSVD_20C |= BIT27;

    SYSBLKCTRL->u_218.PERI_FUNC0_EN |=  SYSBLK_SPI2W_EN_Msk;
    SYSBLKCTRL->u_238.PERI_CLK_CTRL1 |= (SYSBLK_ACTCK_SPI2WIRE_EN_Msk | SYSBLK_SLPCK_SPI2WIRE_EN_Msk);

    SPI3WIRE->CFGR = SPI2W_StoreReg[0];
}
#endif


/********************************************** ********************************************************/
/**************************************** [Timer & PWM DLPS] *******************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_TIM_DLPS

#include "rtl876x_tim.h"
__STATIC_INLINE void TIM_DLPS_Enter(void);
__STATIC_INLINE void TIM_DLPS_Exit(void);

//uint32_t TIM_StoreReg[26];      /*  This array should be placed in RAM ON/Buffer ON.    */
uint32_t TIM_StoreReg[28];
/* PWM, use with timer */
uint32_t PWM0_StoreReg;         /*  This array should be placed in RAM ON/Buffer ON.    */

uint32_t PWM1_StoreReg;         /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  TIMER enter dlps callback function(Save TIMER register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void TIM_DLPS_Enter(void) DATA_RAM_FUNCTION;
void TIM_DLPS_Enter(void)
{
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= BIT(16);
    SYSBLKCTRL->u_230.CLK_CTRL |= (SYSBLK_ACTCK_TIMER_EN_Msk | SYSBLK_SLPCK_TIMER_EN_Msk);

    TIM_StoreReg[0] = TIM0->LoadCount;
    TIM_StoreReg[1] = TIM0->ControlReg;
    TIM_StoreReg[2] = TIMER0_LOAD_COUNT2;

    TIM_StoreReg[3] = TIM1->LoadCount;
    TIM_StoreReg[4] = TIM1->ControlReg;
    TIM_StoreReg[5] = TIMER1_LOAD_COUNT2;

    TIM_StoreReg[6] = TIM2->LoadCount;
    TIM_StoreReg[7] = TIM2->ControlReg;
    TIM_StoreReg[8] = TIMER2_LOAD_COUNT2;

    TIM_StoreReg[9] = TIM3->LoadCount;
    TIM_StoreReg[10] = TIM3->ControlReg;
    TIM_StoreReg[11] = TIMER3_LOAD_COUNT2;

    TIM_StoreReg[12] = TIM4->LoadCount;
    TIM_StoreReg[13] = TIM4->ControlReg;
    TIM_StoreReg[14] = TIMER4_LOAD_COUNT2;

