ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
    TIM_StoreReg[15] = TIM5->LoadCount;
    TIM_StoreReg[16] = TIM5->ControlReg;
    TIM_StoreReg[17] = TIMER5_LOAD_COUNT2;

    TIM_StoreReg[18] = TIM6->LoadCount;
    TIM_StoreReg[19] = TIM6->ControlReg;
    TIM_StoreReg[20] = TIMER6_LOAD_COUNT2;

    TIM_StoreReg[21] = TIM7->LoadCount;
    TIM_StoreReg[22] = TIM7->ControlReg;
    TIM_StoreReg[23] = TIMER7_LOAD_COUNT2;

//   TIM_StoreReg[24] = *((volatile uint32_t *)0x4000035CUL);
//   TIM_StoreReg[25] = *((volatile uint32_t *)0x40000360UL);

    TIM_StoreReg[24] = *((volatile uint32_t *)0x40000348UL);
    TIM_StoreReg[25] = *((volatile uint32_t *)0x40000360UL);

    TIM_StoreReg[26] = *((volatile uint32_t *)0x4000600CUL);
    TIM_StoreReg[27] = *((volatile uint32_t *)0x40000384UL);
    PWM0_StoreReg = TIMER_PWM0_CR;

    PWM1_StoreReg = TIMER_PWM1_CR;
}

/**
  * @brief  TIMER exit dlps callback function(Resume TIMER register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void TIM_DLPS_Exit(void) DATA_RAM_FUNCTION;
void TIM_DLPS_Exit(void)
{
    /* Enable timer IP clock and function */
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= BIT(16);
    SYSBLKCTRL->u_230.CLK_CTRL |= (SYSBLK_ACTCK_TIMER_EN_Msk | SYSBLK_SLPCK_TIMER_EN_Msk);

    *((volatile uint32_t *)0x4000035CUL) = TIM_StoreReg[24];
    *((volatile uint32_t *)0x40000360UL) = TIM_StoreReg[25];
//  *((volatile uint32_t *)0x40000348UL) = TIM_StoreReg[24] ;
//   *((volatile uint32_t *)0x40000360UL) = TIM_StoreReg[25] ;
    TIM0->LoadCount = TIM_StoreReg[0];
    TIM0->ControlReg = TIM_StoreReg[1];
    TIMER0_LOAD_COUNT2 = TIM_StoreReg[2];

    TIM1->LoadCount = TIM_StoreReg[3];
    TIM1->ControlReg = TIM_StoreReg[4];
    TIMER1_LOAD_COUNT2 = TIM_StoreReg[5];

    TIM2->LoadCount = TIM_StoreReg[6];
    TIM2->ControlReg = TIM_StoreReg[7];
    TIMER2_LOAD_COUNT2 = TIM_StoreReg[8];

    TIM3->LoadCount = TIM_StoreReg[9];
    TIM3->ControlReg = TIM_StoreReg[10];
    TIMER3_LOAD_COUNT2 = TIM_StoreReg[11];

    TIM4->LoadCount = TIM_StoreReg[12];
    TIM4->ControlReg = TIM_StoreReg[13];
    TIMER4_LOAD_COUNT2 = TIM_StoreReg[14];

    TIM5->LoadCount = TIM_StoreReg[15];
    TIM5->ControlReg = TIM_StoreReg[16];
    TIMER5_LOAD_COUNT2 = TIM_StoreReg[17];

    TIM6->LoadCount = TIM_StoreReg[18];
    TIM6->ControlReg = TIM_StoreReg[19];
    TIMER6_LOAD_COUNT2 = TIM_StoreReg[20];

    TIM7->LoadCount = TIM_StoreReg[21];
    TIM7->ControlReg = TIM_StoreReg[22];
    TIMER7_LOAD_COUNT2 = TIM_StoreReg[23];

//   *((volatile uint32_t *)0x4000600CUL) = TIM_StoreReg[26];
//   *((volatile uint32_t *)0x40000384UL) = TIM_StoreReg[27];
    TIMER_PWM0_CR = PWM0_StoreReg;

    TIMER_PWM1_CR = PWM1_StoreReg;
}
#endif  /* USE_TIM_DLPS */


/********************************************** ********************************************************/
/**************************************** [UART DLPS] **************************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_UART0_DLPS
#include "rtl876x_uart.h"

__STATIC_INLINE void UART0_DLPS_Enter(void);
__STATIC_INLINE void UART0_DLPS_Exit(void);

uint32_t UART0_StoreReg[12];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  UART0 enter dlps callback function(Save UART0 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void UART0_DLPS_Enter(void) DATA_RAM_FUNCTION;
void UART0_DLPS_Enter(void)
{
    PERIPH->PERI_FUNC0_EN |= (1 << 0);
    PERIPH->PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_UART0DATA_EN_Msk | SYSBLK_SLPCK_UART0DATA_EN_Msk);

    //access DLH and DLL
    UART0->LCR |= (1 << 7);
    UART0_StoreReg[0] = UART0->DLL;
    UART0_StoreReg[1] = UART0->DLH_INTCR;
    UART0->LCR &= (~(1 << 7));

    //save other registers
    UART0_StoreReg[2] = UART0->DLH_INTCR;
    UART0_StoreReg[4] = UART0->LCR;
    UART0_StoreReg[5] = UART0->MCR;
    UART0_StoreReg[6] = UART0->SPR;
    UART0_StoreReg[7] = UART0->STSR;
    UART0_StoreReg[8] = UART0->RX_IDLE_TOCR;
    UART0_StoreReg[9] = UART0->RX_IDLE_INTCR;
    UART0_StoreReg[10] = UART0->MISCR;
    UART0_StoreReg[11] = UART0->INTMASK;

    return;
}

/**
  * @brief  UART0 exit dlps callback function(Resume UART0 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void UART0_DLPS_Exit(void) DATA_RAM_FUNCTION;
void UART0_DLPS_Exit(void)
{
    PERIPH->PERI_FUNC0_EN |= (1 << 0);
    PERIPH->PERI_CLK_CTRL0 |= (SYSBLK_ACTCK_UART0DATA_EN_Msk | SYSBLK_SLPCK_UART0DATA_EN_Msk);

    //access DLH and DLL
    UART0->LCR |= (1 << 7);
    UART0->DLL = UART0_StoreReg[0];
    UART0->DLH_INTCR =  UART0_StoreReg[1];
    UART0->LCR &= (~(1 << 7));

    //access other registers
    UART0->INTID_FCR = (((UART0_StoreReg[7] & BIT24) >> 21) | ((UART0_StoreReg[7] & 0x7C000000) >> 18) |
                        (1));
    UART0->LCR = UART0_StoreReg[4];
    UART0->MCR = UART0_StoreReg[5];
    UART0->SPR = UART0_StoreReg[6];
    UART0->STSR = UART0_StoreReg[7];
    UART0->DLH_INTCR = UART0_StoreReg[2];
    UART0->RX_IDLE_TOCR = UART0_StoreReg[8];
    UART0->RX_IDLE_INTCR = UART0_StoreReg[9];
    UART0->MISCR = UART0_StoreReg[10];
    UART0->INTMASK = UART0_StoreReg[11];

    return;
}
#endif


#if USE_UART1_DLPS
#include "rtl876x_uart.h"

__STATIC_INLINE void UART1_DLPS_Enter(void);
__STATIC_INLINE void UART1_DLPS_Exit(void);

uint32_t UART1_StoreReg[12];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief  UART1 enter dlps callback function(Save UART1 register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void UART1_DLPS_Enter(void) DATA_RAM_FUNCTION;
void UART1_DLPS_Enter(void)
{
    //enable log uart peripheral & clock
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= (1 << 12);
    SYSBLKCTRL->u_230.CLK_CTRL |= ((1 << 12) | (1 << 13));

    //access DLH and DLL
    UART1->LCR |= (1 << 7);
    UART1_StoreReg[0] = UART1->DLL;
    UART1_StoreReg[1] = UART1->DLH_INTCR;
    UART1->LCR &= (~(1 << 7));

