ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
    //save other registers
    UART1_StoreReg[2] = UART1->DLH_INTCR;
    UART1_StoreReg[4] = UART1->LCR;
    UART1_StoreReg[5] = UART1->MCR;
    UART1_StoreReg[6] = UART1->SPR;
    UART1_StoreReg[7] = UART1->STSR;
    UART1_StoreReg[8] = UART1->RX_IDLE_TOCR;
    UART1_StoreReg[9] = UART1->RX_IDLE_INTCR;
    UART1_StoreReg[10] = UART1->MISCR;
    UART1_StoreReg[11] = UART1->INTMASK;

    return;
}

/**
  * @brief  UART1 exit dlps callback function(Resume UART1 register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void UART1_DLPS_Exit(void) DATA_RAM_FUNCTION;
void UART1_DLPS_Exit(void)
{
    //enable log uart peripheral & clock
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= (1 << 12);
    SYSBLKCTRL->u_230.CLK_CTRL |= ((1 << 12) | (1 << 13));

    //access DLH and DLL
    UART1->LCR |= (1 << 7);
    UART1->DLL = UART1_StoreReg[0];
    UART1->DLH_INTCR =  UART1_StoreReg[1];
    UART1->LCR &= (~(1 << 7));

    //access other registers
    UART1->INTID_FCR = (((UART1_StoreReg[7] & BIT24) >> 21) | ((UART1_StoreReg[7] & 0x7C000000)
                                                               >> 18) | (1));
    UART1->LCR = UART1_StoreReg[4];
    UART1->MCR = UART1_StoreReg[5];
    UART1->SPR = UART1_StoreReg[6];
    UART1->STSR = UART1_StoreReg[7];
    UART1->DLH_INTCR = UART1_StoreReg[2];
    UART1->RX_IDLE_TOCR = UART1_StoreReg[8];
    UART1->RX_IDLE_INTCR = UART1_StoreReg[9];
    UART1->MISCR = UART1_StoreReg[10];
    UART1->INTMASK = UART1_StoreReg[11];

    return;
}
#endif

#if USE_LOG_UART2_DLPS
#include "rtl876x_uart.h"

__STATIC_INLINE void LOG_UART2_DLPS_Enter(void);
__STATIC_INLINE void LOG_UART2_DLPS_Exit(void);

uint32_t LOG_UART2_StoreReg[12];        /*  This array should be placed in RAM ON/Buffer ON.    */

/**
  * @brief LOG_UART enter dlps callback function(Save LOG_UART register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LOG_UART2_DLPS_Enter(void) DATA_RAM_FUNCTION;
void LOG_UART2_DLPS_Enter(void)
{
    //enable log uart peripheral & clock
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= (1 << 12);
    SYSBLKCTRL->u_230.CLK_CTRL |= ((1 << 12) | (1 << 13));

    //access DLH and DLL
    UART2->LCR |= (1 << 7);
    LOG_UART2_StoreReg[0] = UART2->DLL;
    LOG_UART2_StoreReg[1] = UART2->DLH_INTCR;
    UART2->LCR &= (~(1 << 7));

    //save other registers
    LOG_UART2_StoreReg[2] = UART2->DLH_INTCR;
    LOG_UART2_StoreReg[4] = UART2->LCR;
    LOG_UART2_StoreReg[5] = UART2->MCR;
    LOG_UART2_StoreReg[6] = UART2->SPR;
    LOG_UART2_StoreReg[7] = UART2->STSR;
    LOG_UART2_StoreReg[8] = UART2->RX_IDLE_TOCR;
    LOG_UART2_StoreReg[9] = UART2->RX_IDLE_INTCR;
    LOG_UART2_StoreReg[10] = UART2->MISCR;
    LOG_UART2_StoreReg[11] = UART2->INTMASK;

    return;
}

/**
  * @brief  LOG_UART exit dlps callback function(Resume LOG_UART register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LOG_UART2_DLPS_Exit(void) DATA_RAM_FUNCTION;
void LOG_UART2_DLPS_Exit(void)
{
    //enable log uart peripheral & clock
    SYSBLKCTRL->u_210.SOC_FUNC_EN |= (1 << 12);
    SYSBLKCTRL->u_230.CLK_CTRL |= ((1 << 12) | (1 << 13));

    //access DLH and DLL
    UART2->LCR |= (1 << 7);
    UART2->DLL = LOG_UART2_StoreReg[0];
    UART2->DLH_INTCR =  LOG_UART2_StoreReg[1];
    UART2->LCR &= (~(1 << 7));

    //access other registers
    UART2->INTID_FCR = (((LOG_UART2_StoreReg[7] & BIT24) >> 21) | ((LOG_UART2_StoreReg[7] & 0x7C000000)
                                                                   >> 18) | (1));
    UART2->LCR = LOG_UART2_StoreReg[4];
    UART2->MCR = LOG_UART2_StoreReg[5];
    UART2->SPR = LOG_UART2_StoreReg[6];
    UART2->STSR = LOG_UART2_StoreReg[7];
    UART2->DLH_INTCR = LOG_UART2_StoreReg[2];
    UART2->RX_IDLE_TOCR = LOG_UART2_StoreReg[8];
    UART2->RX_IDLE_INTCR = LOG_UART2_StoreReg[9];
    UART2->MISCR = LOG_UART2_StoreReg[10];
    UART2->INTMASK = LOG_UART2_StoreReg[11];

    return;
}
#endif

/** @} */ /* End of group IO_DLPS_Functions */

/*============================================================================*
 *                         Platform DLPS
 *============================================================================*/

/** @defgroup Platform_DLPS_Functions Platform DLPS Functions
  * @{
  */

/********************************************** ********************************************************/
/*********************************** [USER Enter DLPS CALLBACK FUCN] *****************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_USER_DEFINE_DLPS_ENTER_CB

DLPS_IO_EnterDlpsCB User_IO_EnterDlpsCB = NULL;

#endif /* USE_USER_DEFINE_DLPS_EXIT_CB */

/********************************************** ********************************************************/
/*********************************** [USER Exit DLPS CALLBACK FUCN] *****************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/
#if USE_USER_DEFINE_DLPS_EXIT_CB

DLPS_IO_ExitDlpsCB User_IO_ExitDlpsCB = NULL;

#endif /* USE_USER_DEFINE_DLPS_EXIT_CB */


#if USE_IO_DRIVER_DLPS

/********************************************** ********************************************************/
/**************************************** [CPU & PINMUX DLPS]*******************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

__STATIC_INLINE void CPU_DLPS_Enter(void);
__STATIC_INLINE void CPU_DLPS_Exit(void);
__STATIC_INLINE void Log_SWD_DLPS_Enter(void);
__STATIC_INLINE void Log_SWD_DLPS_Exit(void);

uint32_t CPU_StoreReg[33];         /*  This array should be placed in RAM ON/Buffer ON.    */
uint32_t PeriIntStoreReg = 0;

/**
  * @brief  CPU enter dlps callback function(Save CPU register values when system enter DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE void CPU_DLPS_Enter(void) DATA_RAM_FUNCTION;
void CPU_DLPS_Enter(void)
{
    //NVIC store
    uint32_t i;

    CPU_StoreReg[0] = NVIC->ISER[0];
    CPU_StoreReg[1] = NVIC->ISPR[0];
    CPU_StoreReg[2] = NVIC->IABR[0];

    //The priority of system on interrupt is 0 at first DLPS ENTER CB, so store and restore is skipped
    for (i = 3; i < 32; ++i)  //skip System_IRQn, WDG_IRQn, BTMAC_IRQn which are handled in rom
    {
        CPU_StoreReg[i] = NVIC->IP[i];
    }

