ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
    CPU_StoreReg[32] = SCB->VTOR;
    /* Save Vendor register */
    PeriIntStoreReg = PERIPHINT->EN;

    return;
}

/**
  * @brief  CPU exit dlps callback function(Resume CPU register values when system exit DLPS)
  * @param  None
  * @retval None
  */
__STATIC_INLINE  void CPU_DLPS_Exit(void) DATA_RAM_FUNCTION;
void CPU_DLPS_Exit(void)
{
    //NVIC restore
    uint32_t i;

    //Don't restore NVIC pending register, but report warning
    //NVIC->ISPR[0] = CPU_StoreReg[1];
    if (CPU_StoreReg[0] & CPU_StoreReg[1])
    {
        /* During enter and exit dlps, system will disable all interrupts. If any interrupt occurs during this period, this log will be printed.
        Every bit of pending register corresponds to an interrupt. Please refer to IRQn_Type from System_IRQn to UART2_IRQn.
        For example:  "miss interrupt: pending register: 0x42000"
        It means that RTC and ADC interrupt occur during dlps store and restore flow. But because all interrupts are masked, these interrupts are pending.
        */
        DLPS_PRINT_WARN1("miss interrupt: pending register: 0x%x", CPU_StoreReg[1]);
    }
    NVIC->IABR[0] = CPU_StoreReg[2];

    //The priority of system on interrupt is 0 at first DLPS ENTER CB, so store and restore is skipped
    for (i = 3; i < 32; ++i) //skip System_IRQn, WDG_IRQn, BTMAC_IRQn which are handled in rom
    {
        NVIC->IP[i] = CPU_StoreReg[i];
    }

    SCB->VTOR = CPU_StoreReg[32];
    PERIPHINT->EN = PeriIntStoreReg;
    NVIC->ISER[0] = CPU_StoreReg[0];

#if (DEBUG_WATCHPOINT_ENABLE == 1)
    void debug_monitor_enable(void);
    debug_monitor_enable();
#endif

    return;
}

/********************************************** ********************************************************/
/**************************************** [LOG & SWD DLPS]*******************************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

/**
  * @brief  Set Log and SWD pins to SW mode.
  * @param  void.
  * @retval void.
  */
__STATIC_INLINE void Log_SWD_DLPS_Enter(void) DATA_RAM_FUNCTION;
void Log_SWD_DLPS_Enter(void)
{
    if (OTP->SWD_ENABLE)
    {
        Pad_Config(P1_0, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_DOWN, PAD_OUT_DISABLE, PAD_OUT_LOW);
        Pad_Config(P1_1, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_DOWN, PAD_OUT_DISABLE, PAD_OUT_LOW);
    }

    Pad_Config(OTP->logPin, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);
}

/**
  * @brief  Set Log and SWD pins to PINMUX mode.
  * @param  void.
  * @retval void.
  */
__STATIC_INLINE void Log_SWD_DLPS_Exit(void) DATA_RAM_FUNCTION;
void Log_SWD_DLPS_Exit(void)
{
    Pad_Config(OTP->logPin, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);

    if (OTP->SWD_ENABLE)
    {
        Pad_Config(P1_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);
        Pad_Config(P1_1, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);
    }
}

/********************************************** ********************************************************/
/*********************************** [Enter & Exit DLPS CALLBACK FUNC] *********************************/
/*******************************************************************************************************/
/*******************************************************************************************************/

/**
  * @brief  IO enter dlps callback function
  * @param  None
  * @retval None
  */
void DLPS_IO_EnterDlpsCb(void) DATA_RAM_FUNCTION;
void DLPS_IO_EnterDlpsCb(void)
{
    /* low stack do it instead */
//    Pad_ClearAllWakeupINT();

//    DBG_DIRECT("DLPS_IO_EnterDlpsCb");
    NVIC_DisableIRQ(System_IRQn);
    CPU_DLPS_Enter();

    Pinmux_DLPS_Enter();

#if USE_USER_DEFINE_DLPS_ENTER_CB
    if (User_IO_EnterDlpsCB)
    {
        User_IO_EnterDlpsCB();
    }
#endif

#if USE_ADC_DLPS
    ADC_DLPS_Enter();
#endif

#if USE_CODEC_DLPS
    CODEC_DLPS_Enter();
#endif

#if USE_CODEC_CH0_EQ1_DLPS
    CODEC_CH0_EQ1_DLPS_Enter();
#endif

#if USE_CODEC_CH0_EQ2_DLPS
    CODEC_CH0_EQ2_DLPS_Enter();
#endif

#if USE_CODEC_CH0_EQ3_DLPS
    CODEC_CH0_EQ3_DLPS_Enter();
#endif

#if USE_CODEC_CH0_EQ4_DLPS
    CODEC_CH0_EQ4_DLPS_Enter();
#endif

#if USE_CODEC_CH0_EQ5_DLPS
    CODEC_CH0_EQ5_DLPS_Enter();
#endif

#if USE_GPIO_DLPS
    GPIO_DLPS_Enter();
#endif

#if USE_I2C0_DLPS
    I2C0_DLPS_Enter();
#endif

#if USE_I2C1_DLPS
    I2C1_DLPS_Enter();
#endif

#if USE_I2S0_DLPS
    I2S0_DLPS_Enter();
#endif

#if USE_I2S1_DLPS
    I2S1_DLPS_Enter();
#endif

#if USE_IF8080_DLPS
    IF8080_DLPS_Enter();
#endif

#if USE_IR_DLPS
    IR_DLPS_Enter();
#endif

#if USE_KEYSCAN_DLPS
    KeyScan_DLPS_Enter();
#endif

#if USE_QDECODER_DLPS
    QuadDecoder_DLPS_Enter();
#endif

#if USE_SPI0_DLPS
    SPI0_DLPS_Enter();
#endif

#if USE_SPI1_DLPS
    SPI1_DLPS_Enter();
#endif

#if USE_SPI2W_DLPS
    SPI2W_DLPS_Enter();
#endif

#if USE_TIM_DLPS
    TIM_DLPS_Enter();
#endif

#if USE_UART0_DLPS
    UART0_DLPS_Enter();
#endif

#if USE_UART1_DLPS
    UART1_DLPS_Enter();
#endif

#if USE_LOG_UART2_DLPS
    LOG_UART2_DLPS_Enter();
#endif

    Log_SWD_DLPS_Enter();
}

/**
  * @brief  IO exit dlps callback function.
  * @param  None
  * @retval None
  */
void DLPS_IO_ExitDlpsCb(void) DATA_RAM_FUNCTION;
void DLPS_IO_ExitDlpsCb(void)
{

//    DBG_BUFFER(TYPE_BUMBLEBEE3, SUBTYPE_FORMAT, MODULE_DLPS, LEVEL_INFO,
//               "DLPS_IO_ExitDlpsCb",0);

    Pinmux_DLPS_Exit();

    Log_SWD_DLPS_Exit();

#if USE_ADC_DLPS
    ADC_DLPS_Exit();
#endif

#if USE_CODEC_DLPS
    CODEC_DLPS_Exit();
#endif

#if USE_CODEC_CH0_EQ1_DLPS
    CODEC_CH0_EQ1_DLPS_Exit();
#endif

#if USE_CODEC_CH0_EQ2_DLPS
    CODEC_CH0_EQ2_DLPS_Exit();
#endif

#if USE_CODEC_CH0_EQ3_DLPS
    CODEC_CH0_EQ3_DLPS_Exit();
#endif

#if USE_CODEC_CH0_EQ4_DLPS
    CODEC_CH0_EQ4_DLPS_Exit();
#endif

#if USE_CODEC_CH0_EQ5_DLPS
    CODEC_CH0_EQ5_DLPS_Exit();
#endif

