ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/peripheral/rtl876x_io_dlps.c
#if USE_GPIO_DLPS
    GPIO_DLPS_Exit();
#endif

#if USE_I2C0_DLPS
    I2C0_DLPS_Exit();
#endif

#if USE_I2C1_DLPS
    I2C1_DLPS_Exit();
#endif

#if USE_I2S0_DLPS
    I2S0_DLPS_Exit();
#endif

#if USE_I2S1_DLPS
    I2S1_DLPS_Exit();
#endif

#if USE_IF8080_DLPS
    IF8080_DLPS_Exit();
#endif

#if USE_IR_DLPS
    IR_DLPS_Exit();
#endif

#if USE_KEYSCAN_DLPS
    KeyScan_DLPS_Exit();
#endif

#if USE_QDECODER_DLPS
    QuadDecoder_DLPS_Exit();
#endif

#if USE_SPI0_DLPS
    SPI0_DLPS_Exit();
#endif

#if USE_SPI1_DLPS
    SPI1_DLPS_Exit();
#endif

#if USE_SPI2W_DLPS
    SPI2W_DLPS_Exit();
#endif

#if USE_TIM_DLPS
    TIM_DLPS_Exit();
#endif

#if USE_UART0_DLPS
    UART0_DLPS_Exit();
#endif

#if USE_UART1_DLPS
    UART1_DLPS_Exit();
#endif

#if USE_LOG_UART2_DLPS
    LOG_UART2_DLPS_Exit();
#endif

#if USE_USER_DEFINE_DLPS_EXIT_CB
    if (User_IO_ExitDlpsCB)
    {
        User_IO_ExitDlpsCB();
    }
#endif

    NVIC_InitTypeDef nvic_init_struct;
    nvic_init_struct.NVIC_IRQChannel         = System_IRQn;
    nvic_init_struct.NVIC_IRQChannelCmd      = (FunctionalState)ENABLE;
    nvic_init_struct.NVIC_IRQChannelPriority = 3;
    NVIC_Init(&nvic_init_struct); //Enable SYSTEM_ON Interrupt

    CPU_DLPS_Exit();
}

/**
  * @brief  register IO DLPS callback function
  * @param  None
  * @retval None
  */
void DLPS_IORegister(void)
{
    dlps_hw_control_cb_reg(DLPS_IO_EnterDlpsCb, DLPS_ENTER);
    dlps_hw_control_cb_reg(DLPS_IO_ExitDlpsCb, DLPS_EXIT4_BT_READY);

    return;
}

#endif /* USE_IO_DRIVER_DLPS */

/** @} */ /* End of group Platform_DLPS_Functions */

/******************* (C) COPYRIGHT 2020 Realtek Semiconductor Corporation *****END OF FILE****/

